<h1>Assignment-2

<b>Question 1</b></br>
Consider the following Python module:

In [2]:
a = 0

def b():
    global a
    a=c(a)

def c(a):
    return a + 2

In [3]:
b()

In [4]:
b()

In [5]:
b()

In [6]:
a

6

In first b() execution not getting any output. however, function b takes global value of a and pass the a value to function c(a) </br>
so that, function c return 0+2=2 </br>
In second b() execution, function plays as similar way, so value of a=2+2=4. </br>
In third b() execution, function plays as similar way, so value of a=4+2=6. </br>
so in the end of execution value of a become 6. </br>

<b>Question 2</b></br>
Function fileLength(), given to you, takes the name of a file as input and returns the length of the file:

In [10]:
def FileLength(FileName):
    try:
        f=open(FileName)
        Info= f.read()
        file.close()
        print(len(Info))
    except:
        print('File {} not found.'.format(FileName))

In [11]:
FileLength('idterm.ipynb')

File idterm.ipynb not found.

<b>Question 3</b></br> Write a class named Marsupial that can be used as shown below:

In [13]:
class  Marsupial:
    def __init__(s):
        s.list=[]
    def put_in_pouch(s,Items):
        s.list.append(Items)
    def pouch_content(s):
        return s.list

m=Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('Kitten')
m.pouch_content()

['doll', 'firetruck', 'Kitten']

In [16]:
class  Marsupial:
    def __init__(s):
        s.list=[]
    def put_in_pouch(s,Items):
        s.list.append(Items)
    def pouch_content(s):
        return s.list

class Kangaroo(Marsupial):
    def __init__(s,xcoordinate,ycoordinate):
        Marsupial.__init__(s)
        s.x=xcoordinate
        s.y=ycoordinate
    def jump(s,dx,dy):
        s.x += dx
        s.y += dy
    def __str__(s):
        return 'I am a kangaroo located at coordinates({},{}).'.format(s.x,s.y)

In [17]:
k=Kangaroo(0,0)
print(k)

I am a kangaroo located at coordinates(0,0).

In [18]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('Kitten')
k.pouch_content()

['doll', 'firetruck', 'Kitten']

In [19]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a kangaroo located at coordinates(3,0).

<b>Question 4</b></br>
Write function collatz() that takes a positive integer x as input and prints the
Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying
this rule to the previous number x in the sequence:</br>
x = {</br>
𝑥/2 𝑖𝑓 𝑥 𝑖𝑠 𝑒𝑣𝑒𝑛</br>
3𝑥 + 1 𝑖𝑓 𝑥 𝑖𝑠 𝑜𝑑𝑑</br>

In [35]:
def collatz(num):
    list=[num]
    if num==1:
        return[1]
    elif num%2 ==0:
        list.extend(collatz(num//2))
    else:
        list.extend(collatz(num*3+1))
    return list

In [36]:
collatz(10)

[10, 5, 16, 8, 4, 2, 1]

<b>Question 5</b></br> Write a recursive method binary() that takes a non-negative integer n and prints the binary representation of integer n.

In [39]:
def binary(n):
    if n>1:
        binary(n//2)
    print(n%2, end = '')

In [41]:
binary(9)

1001

<b>Question 6</b></br>
Implement a class named HeadingParser that can be used to parse an HTML document, and retrieve and print all the headings in the document. You should implement your class as a subclass of HTMLParser, defined in Standard Library module html.parser. When fed a string containing HTML code, your class should print the headings, one per line and in the order in which they appear in the document. Each heading should be indented as follows: an h1 heading should haveindentation 0, and h2 heading should have indentation 1, etc. Test your implementation using w3c.html.

<b>Question 7</b></br> Implement recursive function webdir() that takes as input: a URL (as a string) and non-negative integers depth and indent. Your function should visit every web page reachable from the starting URL web page in depth clicks or less, and print each web page's URL. As shown below, indentation, specified by indent, should be used to indicate the depth of a URL.

<b>Question 8</b></br>
Write SQL queries on the below database table that return:</br>
a) All the temperature data.</br>
b) All the cities, but without repetition.</br>
c) All the records for India.</br>
d) All the Fall records.</br>
e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.</br>
f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.</br>
g) The total annual rainfall for Cairo.</br>
h) The total rainfall for each season.</br>

In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.0-py3-none-any.whl (19 kB)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
Requirement already satisfied: six in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (1.16.0)
Collecting sqlalchemy>=0.6.7
  Downloading SQLAlchemy-1.4.26-cp39-cp39-win_amd64.whl (1.5 MB)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (7.27.0)
Collecting sqlparse
  Downloading sqlparse-0.4.2-py3-none-any.whl (42 kB)
Requirement already satisfied: jedi>=0.16 in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: decorator in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: pickleshare in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: traitlets>=4.2 in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (57.4.0)
Requirement already satisfied: pygments in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: matplotlib-inline in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.3)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp39-cp39-win_amd64.whl (101 kB)
Using legacy 'setup.py install' for prettytable, since package 'wheel' is not installed.
Installing collected packages: greenlet, sqlparse, sqlalchemy, prettytable, ipython-sql
    Running setup.py install for prettytable: started
    Running setup.py install for prettytable: finished with status 'done'
Successfully installed greenlet-1.1.2 ipython-sql-0.4.0 prettytable-0.7.2 sqlalchemy-1.4.26 sqlparse-0.4.2

WARNING: You are using pip version 21.2.4; however, version 21.3.1 is available.
You should consider upgrading via the 'C:\Users\Dharmit panchal\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [41]:
%load_ext sql

In [42]:
%sql sqlite://

In [43]:
pip install --upgrade pip

Requirement already satisfied: pip in c:\users\dharmit panchal\appdata\local\programs\python\python39\lib\site-packages (21.3.1)Note: you may need to restart the kernel to use updated packages.

In [44]:
%%sql
CREATE TABLE weather
( city varchar(6),
  country varchar(6),
season varchar(6),
 temperature float,
  rainfall float
);

 * sqlite://
Done.

[]

In [45]:
%%sql
INSERT INTO weather VALUES('Mumbai','India','Winter',24.8,5.9);

 * sqlite://
1 rows affected.

[]

In [46]:
%%sql
select * from weather;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9)]

In [47]:
%%sql
INSERT INTO weather VALUES('Mumbai','India','Spring',28.4,16.2),
('Mumbai','India','Summer',27.9,1549.4),
('Mumbai','India','Fall',27.6,346.0),
('London','United Kingdom','Winter',4.2,207.7),
('London','United Kingdom','Spring',8.3,169.6),
('London','United Kingdom','Summer',15.7,157.0),
('London','United Kingdom','Fall',10.4,218.5),
('Cairo','Egypt','Winter',13.6,16.5),
('Cairo','Egypt','Spring',20.7,6.5),
('Cairo','Egypt','Summer',27.7,0.1),
('Cairo','Egypt','Fall',22.2,4.5)
;

 * sqlite://
11 rows affected.

[]

In [48]:
%%sql
select * from weather;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [49]:
%%sql
select temperature from weather;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [22]:
%%sql
select DISTINCT city from weather;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [25]:
%%sql
select * from weather WHERE country='India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

In [26]:
%%sql
select * from weather WHERE season='Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [51]:
%%sql
SELECT 
city,country,season 
from weather 
WHERE rainfall BETWEEN 200.0 AND 400.0;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

In [54]:
%%sql
select
city,country,season,temperature 
from weather WHERE
season='Fall' AND temperature>20 order by temperature ASC;

 * sqlite://
Done.

[('Cairo', 'Egypt', 'Fall', 22.2), ('Mumbai', 'India', 'Fall', 27.6)]

In [57]:
%%sql
select SUM(rainfall) AS Annual from weather 
where city='Cairo';

 * sqlite://
Done.

[(27.6,)]

In [59]:
%%sql
select season,sum(rainfall) from weather 
group by season;

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

<b>Question 9</b></br>
. Suppose list words is defined as follows:

In [51]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
print(words)

['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [52]:
##(a)
[x.upper() for x in words]

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [53]:
##(b)
[x.lower() for x in words]

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [54]:
##(c)
[len(i) for i in words]

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [62]:
##(d)
[[x.upper() for x in words],[y.lower() for y in words],[len(i) for i in words]]

[['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG'],
 ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog'],
 [3, 5, 5, 3, 5, 4, 3, 4, 3]]

In [56]:
##(e)
[word for word in words if len(word)>=4]

['quick', 'brown', 'jumps', 'over', 'lazy']